In [1]:
import os
import numpy as np
import pandas as pd

# 1.CRUD 中 Create
## 1.1. 👍Create Series 
## 1.2. 👍Create DataFrame
## 1.2.1. 👍Create Series + concat(concatenate) => 👍Create DataFrame

In [5]:
s1 = pd.Series([10, 20, 30], name="점수")
display(s1)

0    10
1    20
2    30
Name: 점수, dtype: int64

# 1.2. 👍Create DataFrame

In [ ]:
# 1.2.1. Ditionary 형태의 DataFrame 생성
data = {
    "이름" : ["영희", "철수", "민수"],
    "나이" : [20, 21, 19],
    "성별" : ["F", "M", "M"]
}
display(data)

df = pd.DataFrame(data)
display(df)

{'이름': ['영희', '철수', '민수'], '나이': [20, 21, 19], '성별': ['F', 'M', 'M']}

   이름  나이 성별
0  영희  20  F
1  철수  21  M
2  민수  19  M

In [14]:
# 1.2.2. List 형태의 DataFrame 생성
data = [["영희", 20, "F"],
        ["철수", 21, "M"],
        ["민수", 19, "M"]]
df = pd.DataFrame(data, columns=["이름", "나이", "성별"])
display(df)

# columns명 확인
print(df.columns)
# index명 확인 
print(df.index)

   이름  나이 성별
0  영희  20  F
1  철수  21  M
2  민수  19  M

Index(['이름', '나이', '성별'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

In [ ]:
# ✏️ 연습 - 아래 리스트 데이터를 담은 하나의 데이터 프레임을 생성하시오.

name = ["영희", "철수", "민수"]
python_score = [90, 65, 75]
db_score = [100, 85, 65]

# 딕셔너리로 데이터를 구성
data = {
    "이름": ["영희", "철수", "민수"],
    "파이썬": [90, 65, 75],
    "데이터베이스": [100, 85, 65]
}

# 데이터 프레임 생성
display(data)
df_data = pd.DataFrame(data)

# display로 출력
display(df_data)

{'이름': ['영희', '철수', '민수'], '파이썬': [90, 65, 75], '데이터베이스': [100, 85, 65]}

   이름  파이썬  데이터베이스
0  영희   90     100
1  철수   65      85
2  민수   75      65

In [22]:
# 1.2.3. Series 병합해서 DataFrame 만들기
# Series는 1차원 배열로, DataFrame은 2차원 배열입니다.
# Series를 DataFrame으로 변환하려면, Series를 딕셔너리 형태로 변환한 후 DataFrame으로 변환할 수 있습니다.

# Series에 value1을 추가 
s1 = pd.Series([10, 20, 30], name="점수")
display(s1)
# Series에 value2을 추가
s2 = pd.Series(["철수", "영희", "민수"], name="이름")
display(s2)

# Series를 병합해서 DataFrame으로 구성하기 
# 병합하는 함수는?

concat_axis1 = pd.concat([s1,s2], axis=1)
display(concat_axis1)

0    10
1    20
2    30
Name: 점수, dtype: int64

0    철수
1    영희
2    민수
Name: 이름, dtype: object

   점수  이름
0  10  철수
1  20  영희
2  30  민수

# 2.CRUD 中 Read 
## 2.1 👍Read DataFrame
### 2.1.1. indexing과 slicing  가능 有 vs 가능 無
- 위치 기반 접근
- 조건 기반 접금
### 2.1.2. 가능 無 해결방안 => indexer => iloc vs loc

In [27]:
df = pd.DataFrame({
    "이름": ["영희", "철수", "민수"],
    "나이": [20, 21, 19],
    "성별": ["F", "M", "M"]
})

display(df)

   이름  나이 성별
0  영희  20  F
1  철수  21  M
2  민수  19  M

In [33]:
# 위치기반 데이터 접근 => 행 접근(슬라이싱!) 
df[0:2]
df["나이"]
df.loc[0:2, "이름": "성별"]  # loc는 라벨 기반 접근

   이름  나이 성별
0  영희  20  F
1  철수  21  M
2  민수  19  M